 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Значение") Тогда
		Если Параметры.Значение <> "" Тогда
			МассивЗначений = СтрРазделить(Параметры.Значение, ";", Ложь);
			Для каждого Элемент Из МассивЗначений Цикл
				СтрокаТЧ 			= Список.Добавить();    
				СтрокаТЧ.Значение 	= Элемент;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
	Если Параметры.Свойство("Маска") Тогда
		Элементы.СписокЗначение.Маска = Параметры.Маска;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Массив = Новый Массив;
	Для каждого СтрокаТЧ Из Список Цикл
		Массив.Добавить(СтрокаТЧ.Значение);
	КонецЦикла;
	
	СтрокаРезультат = СтрСоединить(Массив, ";");
	
	ОповеститьОВыборе(СтрокаРезультат);
	
КонецПроцедуры


