
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИБ") Тогда  
		Элементы.Страницы.ТекущаяСтраница 	= Элементы.СтраницаМестоРазвертки;
		ТекущаяИБ 							= Параметры.ИБ;   
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборИБ;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	_dl_КонфигурационныеЕдиницы.Ссылка КАК ИнформационнаяБаза,
		|	_dl_ДополнительныеРеквизитыКонфигурационныхЕдиниц.ЗначениеДопРеквизита КАК Описание
		|ИЗ
		|	Справочник._dl_КонфигурационныеЕдиницы КАК _dl_КонфигурационныеЕдиницы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._dl_ДополнительныеРеквизитыКонфигурационныхЕдиниц КАК _dl_ДополнительныеРеквизитыКонфигурационныхЕдиниц
		|		ПО (_dl_ДополнительныеРеквизитыКонфигурационныхЕдиниц.КонфигурационнаяЕдиница = _dl_КонфигурационныеЕдиницы.Ссылка
		|				И _dl_ДополнительныеРеквизитыКонфигурационныхЕдиниц.ТипДопРеквизита = ЗНАЧЕНИЕ(Справочник._dl_ДополнительныеРеквизитыКонфигурационныхЕдиниц.ИнформационнаяБаза1С_Описание))
		|ГДЕ
		|	_dl_КонфигурационныеЕдиницы.Тип = ЗНАЧЕНИЕ(Справочник._dl_ТипыКонфигурационныхЕдиниц.ИнформационнаяБаза1С)
		|	И _dl_КонфигурационныеЕдиницы.КатегорияТипа = ЗНАЧЕНИЕ(Справочник._dl_КатегорииТиповКонфигурационныхЕдиниц.Сервис)
		|	И НЕ _dl_КонфигурационныеЕдиницы.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	_dl_КонфигурационныеЕдиницы.Наименование";
		
		ТаблицаИБ.Загрузить(Запрос.Выполнить().Выгрузить());		
	КонецЕсли;    
	
	Элементы.Назад1.Видимость = НЕ Параметры.Свойство("ИБ");
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяИнфраструктура(Команда)

	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШаблонРазвертки;	
	ТекущееМестоРазвертки = "Новая";
	
КонецПроцедуры

&НаКлиенте
Процедура ОблачнаяИнфраструктура(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОблака;
	ТекущееМестоРазвертки = "Облачная";
	
КонецПроцедуры 

&НаКлиенте
Процедура ВсеНаОдном(Команда)
	
	ТекущееШаблонРазвертки = "ВсеНаОдном";  
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОперационнойСистемы;
	
КонецПроцедуры

&НаКлиенте
Процедура Кластер(Команда)
	
	ТекущееШаблонРазвертки = "Кластер";   
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОперационнойСистемы;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаИБ.ТекущиеДанные;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОблака Тогда 
		Если Не ЗначениеЗаполнено(Облако) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано облако");
			Возврат;
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОперационнойСистемы; 
		ТекущееШаблонРазвертки = "ВсеНаОдном"; 
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОперационнойСистемы Тогда
		Если Не ЗначениеЗаполнено(ОперационнаяСистема) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана операционная система");
			Возврат;
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаполнениеПараметров; 
		ЗаполнитьПараметры();
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборИБ Тогда
		Если ТекущиеДанные = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана информационная база");
			Возврат;
		КонецЕсли;
		
		ТекущаяИБ = ТекущиеДанные.ИнформационнаяБаза; 
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМестоРазвертки;  
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьПрогресс()
	
	МассивЭлементов = Новый Массив;
	Если ТекущееШаблонРазвертки = "ВсеНаОдном" Тогда
		МассивЭлементов.Добавить("Сервер");		
	ИначеЕсли ТекущееШаблонРазвертки = "Кластер" Тогда   
		МассивЭлементов.Добавить("Сервер приложения №1");
		МассивЭлементов.Добавить("Сервер приложения №2");
		МассивЭлементов.Добавить("Сервер БД №1");
		МассивЭлементов.Добавить("Сервер БД №2");
		МассивЭлементов.Добавить("Сервер БД №3");
	КонецЕсли;         
	
	Для каждого Элемент Из МассивЭлементов Цикл
		СтрокаКЕ 					= ДеревоПрогресса.ПолучитьЭлементы().Добавить(); 
		СтрокаКЕ.Процедура 			= Элемент;   
		СтрокаКЕ.ИндексКартинки 	= ?(ТекущееШаблонРазвертки = "Кластер", 0, 0);
		СтрокаКЕ.СтатусПрогресса	= ?(ТекущееШаблонРазвертки = "Кластер", 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"), 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"));
		//ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.inproccess"));
				
		СтрокаДерева 					= СтрокаКЕ.ПолучитьЭлементы().Добавить(); 
		СтрокаДерева.Процедура 			= ?(ОперационнаяСистема = "Linux", "Linux", "Windows");   
		СтрокаДерева.ИндексКартинки 	= 0; 
		СтрокаДерева.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Создание виртуальной машины"; 
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка дисков виртуальной машины";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;  
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка сети виртуальной машины";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		Если ОперационнаяСистема = "Linux" Тогда
			СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
			СтрокаДереваДетальное.Процедура 		= "Настройка репозиториев";  
			СтрокаДереваДетальное.ИндексКартинки 	= 0;
			СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		КонецЕсли;
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Установка базового софта";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		Если ОперационнаяСистема = "Linux" Тогда
			СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
			СтрокаДереваДетальное.Процедура 		= "Установка и настройка Docker";  
			СтрокаДереваДетальное.ИндексКартинки 	= 0; 
			СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		КонецЕсли;
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка корневого сертификата";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Обновление информации о дисках";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;  
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка дисков виртуальной машины";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка времени на виртуальной машине";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;  
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка SSH на виртуальной машине";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДерева 					= СтрокаКЕ.ПолучитьЭлементы().Добавить(); 
		СтрокаДерева.Процедура 			= ?(ОперационнаяСистема = "Linux", "PostgreSQL", "MS SQL");  
		СтрокаДерева.ИндексКартинки 	= 0;
		СтрокаДерева.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Установка " + ?(ОперационнаяСистема = "Linux", "PostgreSQL", "MS SQL");  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка " + ?(ОперационнаяСистема = "Linux", "PostgreSQL", "MS SQL");  
		СтрокаДереваДетальное.ИндексКартинки 	= 0; 
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДерева 					= СтрокаКЕ.ПолучитьЭлементы().Добавить(); 
		СтрокаДерева.Процедура 			= "Сервер 1С";   
		СтрокаДерева.ИндексКартинки 	= ?(ТекущееШаблонРазвертки = "Кластер", 0, 0);
		СтрокаДерева.СтатусПрогресса	= ?(ТекущееШаблонРазвертки = "Кластер", 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"), 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"));
		//ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.inproccess"));
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Подготовка для установки сервера 1С";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0; 
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Установка сервера 1С";  
		СтрокаДереваДетальное.ИндексКартинки 	= 0;
		СтрокаДереваДетальное.СтатусПрогресса	= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful");
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Восстановление базы в " + ?(ОперационнаяСистема = "Linux", "PostgreSQL", "MS SQL");  
		СтрокаДереваДетальное.ИндексКартинки 	= ?(ТекущееШаблонРазвертки = "Кластер", 0, 0); 
		СтрокаДереваДетальное.СтатусПрогресса	= ?(ТекущееШаблонРазвертки = "Кластер", 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"), 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"));
		//ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.inproccess"));
		
		СтрокаДереваДетальное 					= СтрокаДерева.ПолучитьЭлементы().Добавить();
		СтрокаДереваДетальное.Процедура 		= "Настройка базы в кластере 1С";  
		СтрокаДереваДетальное.ИндексКартинки 	= ?(ТекущееШаблонРазвертки = "Кластер", 0, 0);
		СтрокаДереваДетальное.СтатусПрогресса	= ?(ТекущееШаблонРазвертки = "Кластер", 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"), 
		ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.successful"));
		//ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.start"));	
	КонецЦикла;

	Если ТекущееШаблонРазвертки = "ВсеНаОдном" Тогда
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Сервер"; 
		
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Информационная база (клон)";
		
	ИначеЕсли ТекущееШаблонРазвертки = "Кластер" Тогда
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Сервер приложения №1";
		
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Сервер приложения №2";
		
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Сервер БД №1";
		
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Сервер БД №2";
		
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Сервер БД №3"; 
		
		СтрокаТЧ							= ТаблицаНовыхКЕ.Добавить();
		СтрокаТЧ.КонфигурационнаяЕдиница 	= "Информационная база (клон)";
	КонецЕсли;         	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьПрогресс() Экспорт
	
	Счетчик = 1;
	Для каждого СтрокаДерева Из ДеревоПрогресса.ПолучитьЭлементы() Цикл
		
		СтрокаДерева.ИндексКартинки = 0;

		СчетчикДетальные = 1;
		Для каждого ДетальнаяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл				
			Задержка();
			
			ДетальнаяСтрока.ИндексКартинки = 0;
			
			Если СтрокаДерева.ПолучитьЭлементы().Количество() = СчетчикДетальные 
				И Счетчик <> 1 Тогда
				
				ДетальнаяСтрока.ИндексКартинки = 2;
				
			КонецЕсли;
			
			СчетчикДетальные = СчетчикДетальные + 1;
		КонецЦикла;
		
		Задержка();	
		
		Если ДеревоПрогресса.ПолучитьЭлементы().Количество() = Счетчик Тогда
			
			СтрокаДерева.ИндексКартинки = 2;
			
		КонецЕсли;
				
		Счетчик = Счетчик + 1;
	КонецЦикла;	

КонецПроцедуры   

&НаСервере
Процедура Задержка()
	
	б = 0;
	Для А = 1 По 10000 Цикл
		б = б + 1;		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМестоРазвертки Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборИБ;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШаблонРазвертки Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМестоРазвертки;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОблака Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМестоРазвертки;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОперационнойСистемы Тогда 
		Если ТекущееМестоРазвертки = "Новая" Тогда           
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаШаблонРазвертки;
		ИначеЕсли ТекущееМестоРазвертки = "Облачная" Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборОблака;	
		КонецЕсли;
	КонецЕсли;                                

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметры()
	
	ОбщиеРеквизиты 		= ПолучитьРеквизитыИзМакета("ОбщиеРеквизиты");
	
	Если ТекущееШаблонРазвертки = "ВсеНаОдном" Тогда
		ТекущийИдентификаторЭлемента 	= Новый УникальныйИдентификатор;
		ТекущееИмяЭлемента 				= "Сервер";
		
		СтрокаДереваСерверов						= ДеревоСерверов.ПолучитьЭлементы().Добавить();
		СтрокаДереваСерверов.ИмяЭлемента            = ТекущееИмяЭлемента;
		СтрокаДереваСерверов.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
		СтрокаДереваСерверов.Редактируемый			= Истина;		
		
		Для каждого СтрокаТЧ Из ОбщиеРеквизиты Цикл
			Запись = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьМенеджерЗаписи();
			
			Запись.ИмяЭлемента 				= ТекущееИмяЭлемента;
			Запись.Реквизит 				= СтрокаТЧ.Реквизит; 
			Запись.ИдентификаторРеквизита 	= СтрокаТЧ.ИдентификаторРеквизита;
			Запись.ОбязателенДляЗаполнения 	= СтрокаТЧ.ОбязателенДляЗаполнения;
			Запись.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
			Запись.СерверПриложений			= Ложь;
			Запись.МестоИспользования		= "КластерСерверов";
			
			Запись.Записать();	
		КонецЦикла;	

	ИначеЕсли ТекущееШаблонРазвертки = "Кластер" Тогда		
		
		РеквизитыСерверовБД = ПолучитьРеквизитыИзМакета("РеквизитыСерверовБД");
		
		ТекущееИмяЭлемента 						= "Серверы приложений";
		СтрокаРодитель							= ДеревоСерверов.ПолучитьЭлементы().Добавить();
		СтрокаРодитель.ИмяЭлемента          	= ТекущееИмяЭлемента; 
		СтрокаРодитель.Редактируемый			= Истина;
		
		ТекущийИдентификаторЭлемента 	= Новый УникальныйИдентификатор;
		ТекущееИмяЭлемента 				= "Сервер приложения №1";
		
		СтрокаДерева						= СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаДерева.ИмяЭлемента            = ТекущееИмяЭлемента;
		СтрокаДерева.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
		СтрокаДерева.Редактируемый			= Ложь;
		
		Для каждого СтрокаТЧ Из ОбщиеРеквизиты Цикл
			Запись = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьМенеджерЗаписи();
			
			Запись.ИмяЭлемента 				= ТекущееИмяЭлемента;
			Запись.Реквизит 				= СтрокаТЧ.Реквизит; 
			Запись.ИдентификаторРеквизита 	= СтрокаТЧ.ИдентификаторРеквизита;
			Запись.ОбязателенДляЗаполнения 	= СтрокаТЧ.ОбязателенДляЗаполнения;
			Запись.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
			Запись.СерверПриложений			= Истина; 
			Запись.МестоИспользования		= "КластерСерверов";
			
			Запись.Записать();	
		КонецЦикла;	
		
		ТекущийИдентификаторЭлемента 	= Новый УникальныйИдентификатор;
		ТекущееИмяЭлемента 				= "Сервер приложения №2";
		
		СтрокаДерева						= СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаДерева.ИмяЭлемента            = ТекущееИмяЭлемента;
		СтрокаДерева.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
		СтрокаДерева.Редактируемый			= Ложь;
		
		Для каждого СтрокаТЧ Из ОбщиеРеквизиты Цикл
			Запись = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьМенеджерЗаписи();
			
			Запись.ИмяЭлемента 				= ТекущееИмяЭлемента;
			Запись.Реквизит 				= СтрокаТЧ.Реквизит; 
			Запись.ИдентификаторРеквизита 	= СтрокаТЧ.ИдентификаторРеквизита;
			Запись.ОбязателенДляЗаполнения 	= СтрокаТЧ.ОбязателенДляЗаполнения;
			Запись.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
			Запись.СерверПриложений			= Истина;   
			Запись.МестоИспользования		= "КластерСерверов";
			
			Запись.Записать();	
		КонецЦикла;	
		
		ТекущееИмяЭлемента 					= "Monitor nodes";
		СтрокаРодитель						= ДеревоСерверов.ПолучитьЭлементы().Добавить();
		СтрокаРодитель.ИмяЭлемента          = ТекущееИмяЭлемента; 
		СтрокаРодитель.Редактируемый		= Истина;
		
		ТекущийИдентификаторЭлемента 	= Новый УникальныйИдентификатор;
		ТекущееИмяЭлемента 				= "Monitor node";
		
		СтрокаДерева						= СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаДерева.ИмяЭлемента            = ТекущееИмяЭлемента;
		СтрокаДерева.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
		СтрокаДерева.Редактируемый			= Ложь;
		
		Для каждого СтрокаТЧ Из ОбщиеРеквизиты Цикл
			Запись = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьМенеджерЗаписи();
			
			Запись.ИмяЭлемента 				= ТекущееИмяЭлемента;
			Запись.Реквизит 				= СтрокаТЧ.Реквизит; 
			Запись.ИдентификаторРеквизита 	= СтрокаТЧ.ИдентификаторРеквизита;
			Запись.ОбязателенДляЗаполнения 	= СтрокаТЧ.ОбязателенДляЗаполнения;
			Запись.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
			Запись.СерверПриложений			= Ложь;  
			Запись.МестоИспользования		= "КластерСерверов";
			
			Запись.Записать();	
		КонецЦикла;	
			
		ТекущееИмяЭлемента 					= "Data nodes";
		СтрокаРодитель						= ДеревоСерверов.ПолучитьЭлементы().Добавить();
		СтрокаРодитель.ИмяЭлемента          = ТекущееИмяЭлемента; 
		СтрокаРодитель.Редактируемый		= Истина;

		ТекущийИдентификаторЭлемента 	= Новый УникальныйИдентификатор;
		ТекущееИмяЭлемента 				= "Master data node";
		
		СтрокаДерева						= СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаДерева.ИмяЭлемента            = ТекущееИмяЭлемента;
		СтрокаДерева.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
		СтрокаДерева.Редактируемый			= Ложь;
		
		Для каждого СтрокаТЧ Из ОбщиеРеквизиты Цикл
			Запись = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьМенеджерЗаписи();
			
			Запись.ИмяЭлемента 				= ТекущееИмяЭлемента;
			Запись.Реквизит 				= СтрокаТЧ.Реквизит; 
			Запись.ИдентификаторРеквизита 	= СтрокаТЧ.ИдентификаторРеквизита;
			Запись.ОбязателенДляЗаполнения 	= СтрокаТЧ.ОбязателенДляЗаполнения;
			Запись.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
			Запись.СерверПриложений			= Ложь;
			Запись.МестоИспользования		= "КластерСерверов";
			
			Запись.Записать();	
		КонецЦикла;	

		ТекущийИдентификаторЭлемента 	= Новый УникальныйИдентификатор;
		ТекущееИмяЭлемента 				= "Secondary data node";
		
		СтрокаДерева						= СтрокаРодитель.ПолучитьЭлементы().Добавить();
		СтрокаДерева.ИмяЭлемента            = ТекущееИмяЭлемента;
		СтрокаДерева.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
		СтрокаДерева.Редактируемый			= Ложь;
		
		Для каждого СтрокаТЧ Из ОбщиеРеквизиты Цикл
			Запись = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьМенеджерЗаписи();
			
			Запись.ИмяЭлемента 				= ТекущееИмяЭлемента;
			Запись.Реквизит 				= СтрокаТЧ.Реквизит; 
			Запись.ИдентификаторРеквизита 	= СтрокаТЧ.ИдентификаторРеквизита;
			Запись.ОбязателенДляЗаполнения 	= СтрокаТЧ.ОбязателенДляЗаполнения;
			Запись.ИдентификаторЭлемента 	= ТекущийИдентификаторЭлемента;
			Запись.СерверПриложений			= Ложь;
			Запись.МестоИспользования		= "КластерСерверов";
			
			Запись.Записать();	
		КонецЦикла;	
   	КонецЕсли;
		
КонецПроцедуры    

&НаСервере
Функция ПолучитьРеквизитыИзМакета(Область) Экспорт
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет 			= ОбработкаОбъект.ПолучитьМакет("РеквизитыСерверов");
	
	ОбластьСПараметрами = Макет.ПолучитьОбласть(Область);
	
	КвалификаторСтрока1 = Новый КвалификаторыСтроки(150);
	КвалификаторСтрока2 = Новый КвалификаторыСтроки(36);

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Реквизит", 				Новый ОписаниеТипов("Строка",,,,КвалификаторСтрока1)); 
	ТЗ.Колонки.Добавить("ИдентификаторРеквизита", 	Новый ОписаниеТипов("Строка",,,,КвалификаторСтрока2));
	ТЗ.Колонки.Добавить("ОбязателенДляЗаполнения", 	Новый ОписаниеТипов("Булево"));
	ТЗ.Колонки.Добавить("nameInAPI", 				Новый ОписаниеТипов("Строка",,,,КвалификаторСтрока1));
	
	Для ИндСтроки = 1 По ОбластьСПараметрами.ВысотаТаблицы Цикл          
		СтрокаТЗ 							= ТЗ.Добавить();
		СтрокаТЗ.Реквизит 					= ОбластьСПараметрами.Область(ИндСтроки, 1, ИндСтроки, 1).Текст;
		СтрокаТЗ.ИдентификаторРеквизита 	= ОбластьСПараметрами.Область(ИндСтроки, 2, ИндСтроки, 2).Текст;
		СтрокаТЗ.ОбязателенДляЗаполнения 	= ОбластьСПараметрами.Область(ИндСтроки, 3, ИндСтроки, 3).Текст;
		СтрокаТЗ.nameInAPI 					= ОбластьСПараметрами.Область(ИндСтроки, 4, ИндСтроки, 4).Текст;	
	КонецЦикла;
	 
	Возврат ТЗ; 
	
КонецФункции

&НаКлиенте
Процедура Готово(Команда)  
	
	ГотовоНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ГотовоНаСервере()
	
	Отказ = Ложь;
	ПроизвестиПроверкиПередСозданиемИнфраструктуры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПрогресса;	

	СоздатьИнфраструктуру();

КонецПроцедуры   

&НаСервере
Процедура СоздатьИнфраструктуру()
	
	СпрИнфраструктура 				= Справочники._dl_ЗаданиеНаСозданиеИнфраструктуры.СоздатьЭлемент();
	СпрИнфраструктура.Наименование 	= "Контур под базу "+ТекущаяИБ;
	
	ТЧОбъекты = СпрИнфраструктура.ОбъектыИнфраструктуры; 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИмяЭлемента КАК ИмяЭлемента
		|ИЗ
		|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
		|ГДЕ
		|	_dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""
		|
		|СГРУППИРОВАТЬ ПО
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИмяЭлемента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИмяЭлемента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита КАК ИдентификаторРеквизита,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИмяЭлемента КАК ИмяЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.Реквизит КАК Реквизит,
		|	_dl_ПромежуточноеЗаполнениеКЕ.Значение КАК Значение,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ОбязателенДляЗаполнения КАК ОбязателенДляЗаполнения,
		|	_dl_ПромежуточноеЗаполнениеКЕ.СерверПриложений КАК СерверПриложений,
		|	_dl_ПромежуточноеЗаполнениеКЕ.РодительРеквизита КАК РодительРеквизита,
		|	_dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования КАК МестоИспользования,
		|	_dl_ПромежуточноеЗаполнениеКЕ.nameInAPI КАК nameInAPI
		|ИЗ
		|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
		|ГДЕ
		|	_dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ВыборкаОбъекты 	= Пакет[0].Выбрать(); 
	ТЗВсеДанные		= Пакет[1].Выгрузить();
	
	Пока ВыборкаОбъекты.Следующий() Цикл
		
		//Объект
		СтрокаТЧОбъекты 						= ТЧОбъекты.Добавить();
		СтрокаТЧОбъекты.ИмяОбъекта 				= ВыборкаОбъекты.ИмяЭлемента;
		СтрокаТЧОбъекты.ИдентификаторОбъекта 	= ВыборкаОбъекты.ИдентификаторЭлемента; 
		СтрокаТЧОбъекты.Статус 					= ПредопределенноеЗначение("Перечисление._dl_СтатусСозданияИнфраструктуры.start"); 
			
		//СтрокиОбъекта = ТЗВсеДанные.НайтиСтроки(Новый Структура("ИдентификаторЭлемента", ВыборкаОбъекты.ИдентификаторЭлемента));
		//	
		//Для каждого СтрокаОбъекта Из СтрокиОбъекта Цикл 
		//	Диски = Новый Массив;	
		//	
		//	СтрокиОбъекта.НайтиСтроки("");
		//	
		//КонецЦикла;
		
		//Кубики
		Диски 			= Новый Массив;
		ДанныеРеквизитаКоличествоДисков	= ТЗВсеДанные.НайтиСтроки(Новый Структура("ИдентификаторЭлемента, ИдентификаторРеквизита", ВыборкаОбъекты.ИдентификаторЭлемента, "cba48746-01d2-447a-aea1-f2de5f9787f2"));
		
		Для каждого ДанныеКоличестваДисков Из ДанныеРеквизитаКоличествоДисков Цикл
			
			ВсеДиски = ТЗВсеДанные.НайтиСтроки(Новый Структура("ИдентификаторЭлемента, РодительРеквизита", ВыборкаОбъекты.ИдентификаторЭлемента, ДанныеКоличестваДисков.ИдентификаторРеквизита));
			
			Для каждого ДанныеПоДиску Из ВсеДиски Цикл
				РеквизитыДиска = ТЗВсеДанные.НайтиСтроки(Новый Структура("ИдентификаторЭлемента, РодительРеквизита", ВыборкаОбъекты.ИдентификаторЭлемента, ДанныеПоДиску.ИдентификаторРеквизита));
				
				СтруктураДиск 		= Новый Структура(); 
				СтруктураДиск.Вставить("name", ДанныеПоДиску.Реквизит);
				
				Для каждого РеквизитДиска Из РеквизитыДиска Цикл
					СтруктураДиск.Вставить(РеквизитДиска.nameInAPI,	РеквизитДиска.Значение); 
				КонецЦикла;	
			КонецЦикла;
			
			

			//Кубики
			//СозданиеVMWare(ВыборкаДетальные);
			//СозданиеSQL(ВыборкаДетальные);
			//СозданиеКластера1С(ВыборкаДетальные);
			
		КонецЦикла;
			
		//СтрокаТЧОбъекты.КонфигОбъекта = КонфигОбъекта;
		
	КонецЦикла;
		
КонецПроцедуры   

&НаСервере
Процедура СозданиеVMWare(Выборка)
	
	
	
	
	//Создание VMWare  
	Диски = Новый Массив;
	
	
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("delete_vm_if_exist", false);
    Соответствие.Вставить("add_to_AD", false);
	Соответствие.Вставить("add_to_AD", false);
	Соответствие.Вставить("add_to_AD", false);
	Соответствие.Вставить("add_to_AD", false);
	Соответствие.Вставить("add_to_AD", false);
	Соответствие.Вставить("add_to_AD", false);
	Соответствие.Вставить("add_to_AD", false);
	Соответствие.Вставить("add_to_AD", false);
	
//{
//"delete_vm_if_exist": false,
//"add_to_AD": false,
//"disks": [
//{
//"label": "string",
//"name": "string",
//"size": 100,
//"datastore": "string",
//"type": "thin",
//"unit_number": 127,
//"mount_folder": "string"
//}
//],
//"host_cpu": 1,
//"num_cpu_cores_per_socket": 1,
//"host_memory": 100,
//"hostname_vm": "string",
//"host_ip": "192.168.0.1",
//"host_netmask": "string",
//"host_gateway": "192.168.0.1",
//"host_vmware_vlan": "string",
//"domain_admin_login": "string",
//"domain_admin_pass": "string",
//"vcenter_hostname": "string",
//"vcenter_username": "string",
//"vcenter_password": "string",
//"vcenter_datacenter": "string",
//"vcenter_cluster": "string",
//"vmware_folder": "string",
//"vm_template": "string",
//"os_type": "linux",
//"locale": "ru_RU.UTF-8",
//"time_zone": "Etc/GMT+12",
//"ansible_user": "string",
//"ansible_ssh_pass": "string",
//"ansible_become_password": "string",
//"domain": "string",
//"dns_servers": [
//"192.168.0.1"
//],
//"ad_dns_servers": [
//"192.168.0.1"
//],
//"ntp_servers": [
//"192.168.0.1"
//],
//"docker_data_folder": "string",
//"docker_global_network": "string",
//"linux_comp_ou": "string"
//}	
	Json = _dl_СозданиеИнфраструктуры.СтруктуруВJSON(Соответствие);

КонецПроцедуры

&НаСервере
Процедура СозданиеSQL()

		//SQL 
	
//	{
//  "node_server_connect_settings": {
//    "monitor_node": {
//      "ansible_user": "string",
//      "ansible_ssh_pass": "string",
//      "ansible_become_password": "string",
//      "host_ip": "192.168.0.1",
//      "host_name": "string"
//    },
//    "master_node": {
//      "ansible_user": "string",
//      "ansible_ssh_pass": "string",
//      "ansible_become_password": "string",
//      "host_ip": "192.168.0.1",
//      "host_name": "string"
//    },
//    "second_node": [
//      {
//        "ansible_user": "string",
//        "ansible_ssh_pass": "string",
//        "ansible_become_password": "string",
//        "host_ip": "192.168.0.1",
//        "host_name": "string"
//      }
//    ]
//  },
//  "pg_cluster_settings": {
//    "postgres_server_version": "12",
//    "postgres_server_work_dir": "/data/postgresql",
//    "postgres_port": 5432,
//    "postgres_pass": "string",
//    "listen_addresses": "*",
//    "max_connections": 1000,
//    "linux_cluster_name": "string",
//    "linux_cluster_ip": "192.168.0.1",
//    "monitor_node": "string",
//    "monitor_port": 5432,
//    "db_dump_path": "string",
//    "domain": "string",
//    "time_zone": "Etc/GMT+12"
//  }
//}
//	

КонецПроцедуры 

&НаСервере
Процедура СозданиеКластера1С()

	//Кластер 1С
//	{
//"service_name": "string",
//"ones_version": "8.3.22.1672",
//"ones_base_name": "string",
//"db_name": "string",
//"linux_cluster_name": "string",
//"postgres_pass": "string",
//"ones_binary_url": "http://example.com",
//"ones_nodes": [
//{}
//],
//"components": "additional_admin_functions",
//"language": "ar"
//}

КонецПроцедуры   

&НаСервере
Функция СоздатьПоручениеНаСервере(Json)

	Спр 								= Справочники._dl_ПорученияПоСозданиюИнфраструктуры.СоздатьЭлемент();	
	//Спр.Наименование 					= "Создание инфраструктуры от " + Строка(ТекущаяДатаСеанса());
	//Спр.КонфигJSON 						= КонфигJSON;
	//Спр.ВерсияПротокола 				= ВерсияПротокола;
	//Спр.БазаОтправитель 				= БазаОтправитель;
	//Спр.ШаблонСозданияИнфраструктуры 	= ШаблонСозданияИнфраструктуры;
	//Спр.СредаВиртуализацииКластер 		= СредаВиртуализацииКластер;
	//Спр.СредаВиртуализацииЛогин 		= СредаВиртуализацииЛогин;
	//Спр.СредаВиртуализацииПароль 		= СредаВиртуализацииПароль;
	
	//Для Каждого Стр Из ОбъектыДляСоздания Цикл 
	//	НовСтр = Спр.ОбъектыДляСоздания.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	//КонецЦикла;
	Спр.Записать();
	
	Возврат Спр.Ссылка;
	
КонецФункции

&НаСервере
Процедура ПроизвестиПроверкиПередСозданиемИнфраструктуры(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ОбязателенДляЗаполнения КАК ОбязателенДляЗаполнения,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИмяЭлемента КАК ИмяЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.Реквизит КАК Реквизит,
		|	_dl_ПромежуточноеЗаполнениеКЕ.Значение КАК Значение
		|ИЗ
		|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
		|ГДЕ
		|	_dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""
		|	И _dl_ПромежуточноеЗаполнениеКЕ.ОбязателенДляЗаполнения
		|	И _dl_ПромежуточноеЗаполнениеКЕ.Значение = """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле """+Выборка.Реквизит+""" элемента "+Выборка.ИмяЭлемента+" не заполнено",,,,Отказ);			
	КонецЦикла;	

КонецПроцедуры 

&НаКлиенте
Процедура ДеревоСерверовПриАктивизацииСтроки(Элемент)
		
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	ПодключитьОбработчикОжидания("ОбработатьСтрокуДереваСерверов", 0.1, Истина);

КонецПроцедуры  

&НаКлиенте
Процедура ОбработатьСтрокуДереваСерверов() Экспорт
	
	ТекущиеДанные = ДеревоСерверов.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;	
	КонецЕсли;
	
	ОбработатьСтрокуДереваСерверовНаСервере(ТекущиеДанные.ИдентификаторЭлемента, ТекущиеДанные.ИмяЭлемента);
	
	ОтключитьОбработчикОжидания("ОбработатьСтрокуДереваСерверов");
		
КонецПроцедуры    

&НаСервере
Процедура ОбработатьСтрокуДереваСерверовНаСервере(ИдентификаторЭлемента, Имя)
	
	Если ЗначениеЗаполнено(ИдентификаторЭлемента) Тогда	
		ЗаполнитьТаблицуДаннымиРС(ИдентификаторЭлемента);
	Иначе     
		ЗаполнитьДанныеДляГруппировки(Имя);
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьДанныеДляГруппировки(Имя)
	
	ДеревоРеквизитов.ПолучитьЭлементы().Очистить(); 
	
	ОбщиеРеквизиты = ПолучитьРеквизитыИзМакета("ОбщиеРеквизиты");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Реквизит КАК Реквизит,
	|	ТЗ.ОбязателенДляЗаполнения КАК ОбязателенДляЗаполнения,
	|	ТЗ.ИдентификаторРеквизита КАК ИдентификаторРеквизита
	|ПОМЕСТИТЬ втРеквизиты
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(втРеквизиты.Реквизит, ПромежуточноеЗаполнениеКЕ.Реквизит) КАК Реквизит,
	|	ЕСТЬNULL(ПромежуточноеЗаполнениеКЕ.Значение, """") КАК Значение,
	|	ЕСТЬNULL(втРеквизиты.ОбязателенДляЗаполнения, ПромежуточноеЗаполнениеКЕ.ОбязателенДляЗаполнения) КАК ОбязателенДляЗаполнения,
	|	ЕСТЬNULL(втРеквизиты.ИдентификаторРеквизита, ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита) КАК ИдентификаторРеквизита,
	|	ЕСТЬNULL(ПромежуточноеЗаполнениеКЕ.РодительРеквизита, """") КАК РодительРеквизита
	|ИЗ
	|	втРеквизиты КАК втРеквизиты
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК ПромежуточноеЗаполнениеКЕ
	|		ПО втРеквизиты.ИдентификаторРеквизита = ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита
	|ГДЕ
	|	ПромежуточноеЗаполнениеКЕ.СерверПриложений = &СерверПриложений
	|	И ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ПромежуточноеЗаполнениеКЕ.Значение, """"),
	|	ЕСТЬNULL(втРеквизиты.Реквизит, ПромежуточноеЗаполнениеКЕ.Реквизит),
	|	ЕСТЬNULL(втРеквизиты.ОбязателенДляЗаполнения, ПромежуточноеЗаполнениеКЕ.ОбязателенДляЗаполнения),
	|	ЕСТЬNULL(втРеквизиты.ИдентификаторРеквизита, ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита),
	|	ЕСТЬNULL(ПромежуточноеЗаполнениеКЕ.РодительРеквизита, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реквизит
	|ИТОГИ ПО
	|	ИдентификаторРеквизита";      
	
	Запрос.УстановитьПараметр("СерверПриложений", 	(Имя = "Серверы приложений"));
	Запрос.УстановитьПараметр("ТЗ", 				ОбщиеРеквизиты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
					
		ВыборкаДетальных = Выборка.Выбрать();  
		ВыборкаДетальных.Следующий();    
		
		Если ЗначениеЗаполнено(ВыборкаДетальных.РодительРеквизита) Тогда
			Продолжить;	
		КонецЕсли;	
		
		СтрокаДерева 						= ДеревоРеквизитов.ПолучитьЭлементы().Добавить(); 
		СтрокаДерева.ИдентификаторРеквизита = Выборка.ИдентификаторРеквизита;

		СтрокаДерева.ОбязателенДляЗаполнения 	= ВыборкаДетальных.ОбязателенДляЗаполнения;  
		СтрокаДерева.Реквизит 					= ВыборкаДетальных.Реквизит;	
	
		Если ВыборкаДетальных.Количество() = 1 Тогда	
			СтрокаДерева.Значение = ВыборкаДетальных.Значение;      				
		КонецЕсли;
	КонецЦикла;	       
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл		
		ВыборкаДетальных = Выборка.Выбрать();  
		ВыборкаДетальных.Следующий();    
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальных.РодительРеквизита) Тогда
			Продолжить;	
		КонецЕсли;	
				
		Если ВыборкаДетальных.Количество() = 1 Тогда				
			СтрокаРодитель = НайтиРодителяДереваРеквизитов(ДеревоРеквизитов.ПолучитьЭлементы(), ВыборкаДетальных.РодительРеквизита);
			
			Если СтрокаРодитель = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДерева = СтрокаРодитель.ПолучитьЭлементы().Добавить();	
			ЗаполнитьЗначенияСвойств(СтрокаДерева, ВыборкаДетальных);
		КонецЕсли;
	КонецЦикла;		
		
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуДаннымиРС(ИдентификаторЭлемента)
	
	ДеревоРеквизитов.ПолучитьЭлементы().Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_dl_ПромежуточноеЗаполнениеКЕ.Реквизит КАК Реквизит,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита КАК ИдентификаторРеквизита,
		|	_dl_ПромежуточноеЗаполнениеКЕ.Значение КАК Значение,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ОбязателенДляЗаполнения КАК ОбязателенДляЗаполнения,
		|	_dl_ПромежуточноеЗаполнениеКЕ.СерверПриложений КАК СерверПриложений,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.РодительРеквизита КАК РодительРеквизита
		|ИЗ
		|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
		|ГДЕ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента = &ИдентификаторЭлемента
		|	И _dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""
		|
		|УПОРЯДОЧИТЬ ПО
		|	Реквизит";
	
	Запрос.УстановитьПараметр("ИдентификаторЭлемента", ИдентификаторЭлемента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		Если ЗначениеЗаполнено(Выборка.РодительРеквизита) Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаДерева = ДеревоРеквизитов.ПолучитьЭлементы().Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);			
	КонецЦикла;          //ДеревоРеквизитов.ПолучитьЭлементы()[1].ПолучитьЭлементы()
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл	
		Если НЕ ЗначениеЗаполнено(Выборка.РодительРеквизита) Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаРодитель = НайтиРодителяДереваРеквизитов(ДеревоРеквизитов.ПолучитьЭлементы(), Выборка.РодительРеквизита);
		
		Если СтрокаРодитель = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДерева = СтрокаРодитель.ПолучитьЭлементы().Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);			
	КонецЦикла;

КонецПроцедуры 

&НаСервере
Функция НайтиРодителяДереваРеквизитов(ЭлементыДерева, ИдентификаторРодителя)	
	
	Для каждого СтрокаДерева Из ЭлементыДерева Цикл
		Если СтрокаДерева.ИдентификаторРеквизита = ИдентификаторРодителя Тогда
			Возврат СтрокаДерева;
		КонецЕсли;
		
		НайденнаяСтрокаДерева = НайтиРодителяДереваРеквизитов(СтрокаДерева.ПолучитьЭлементы(), ИдентификаторРодителя);	
		Если НайденнаяСтрокаДерева <> Неопределено Тогда
			Возврат НайденнаяСтрокаДерева;
		КонецЕсли;	
	КонецЦикла;   
	
	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ДеревоРеквизитовЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = ДеревоРеквизитов.НайтиПоИдентификатору(Элемент.Родитель.ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;	
	КонецЕсли;     
	
	ТекущееЗначение = Текст;
	
	ТекущиеДанныеДерева = Элементы.ДеревоСерверов.ТекущиеДанные;     
	
	Если ТекущиеДанныеДерева = Неопределено Тогда 
		ТекущееИмяЭлемента = "";	         
	Иначе
		ТекущееИмяЭлемента = ТекущиеДанныеДерева.ИмяЭлемента;
	КонецЕсли;

	ТекущийИдентификаторЭлемента 	= ТекущиеДанные.ИдентификаторЭлемента; 
	ТекущийИдентификаторРеквизита 	= ТекущиеДанные.ИдентификаторРеквизита;

	ПодключитьОбработчикОжидания("ИзменитьЗначениеРеквизита", 0.1, Истина);	
	
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьЗначениеРеквизита() Экспорт

	ИзменитьЗначениеРеквизитаНаСервере();	
	ОтключитьОбработчикОжидания("ИзменитьЗначениеРеквизита");
	
КонецПроцедуры 

&НаСервере
Процедура ИзменитьЗначениеРеквизитаНаСервере()
	
	Если ЗначениеЗаполнено(ТекущийИдентификаторЭлемента) Тогда	
		Набор = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторЭлемента.Установить(ТекущийИдентификаторЭлемента);
		Набор.Отбор.ИдентификаторРеквизита.Установить(ТекущийИдентификаторРеквизита);
		Набор.Прочитать();
		
		Для каждого Запись Из Набор Цикл
			Запись.Значение = ТекущееЗначение;	
		КонецЦикла;           
		
		Набор.Записать();  
	Иначе  
		МассивСерверов = Новый Массив;
		Для каждого СтрокаДерева Из ДеревоСерверов.ПолучитьЭлементы() Цикл
			Если СтрокаДерева.ИмяЭлемента <> ТекущееИмяЭлемента Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого СтрокаСервера Из СтрокаДерева.ПолучитьЭлементы() Цикл
				Если СтрокаСервера.Редактируемый Тогда
					МассивСерверов.Добавить(СтрокаСервера.ИдентификаторЭлемента);
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита КАК ИдентификаторРеквизита
		|ИЗ
		|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
		|ГДЕ
		|	_dl_ПромежуточноеЗаполнениеКЕ.СерверПриложений = &СерверПриложений
		|	И _dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита = &ИдентификаторРеквизита
		|	И _dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента В(&МассивСерверов)
		|	И _dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""";
		
		Запрос.УстановитьПараметр("МассивСерверов", 		МассивСерверов);
		Запрос.УстановитьПараметр("ИдентификаторРеквизита", ТекущийИдентификаторРеквизита);
		Запрос.УстановитьПараметр("СерверПриложений", 		(ТекущееИмяЭлемента = "Серверы приложений"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Набор = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьНаборЗаписей();
			Набор.Отбор.ИдентификаторЭлемента.Установить(Выборка.ИдентификаторЭлемента);
			Набор.Отбор.ИдентификаторРеквизита.Установить(Выборка.ИдентификаторРеквизита);
			Набор.Прочитать();
			
			Для каждого Запись Из Набор Цикл
				Запись.Значение = ТекущееЗначение;	
			КонецЦикла;           
			
			Набор.Записать();	
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры		   

&НаКлиенте
Процедура ДеревоСерверовРедактируемыйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоСерверов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Редактируемый Тогда //ТекущиеДанные.ИмяЭлемента = "Монитор" 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",ЭтотОбъект);
		ПоказатьВопрос(Оповещение,"Сервер настроен по умолчанию, вы действительно хотите редактировать реквизиты?", РежимДиалогаВопрос.ДаНет);    
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ТекущиеДанные = Элементы.ДеревоСерверов.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.Редактируемый = Ложь;
	КонецЕсли;	
 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРеквизитовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда  
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ИдентификаторРеквизита = "cba48746-01d2-447a-aea1-f2de5f9787f2" Тогда
		Элементы.ДеревоРеквизитовЗначение.РежимВыбораИзСписка = Истина;
		Элементы.ДеревоРеквизитовЗначение.СписокВыбора.Добавить("0");
		Элементы.ДеревоРеквизитовЗначение.СписокВыбора.Добавить("1");
		Элементы.ДеревоРеквизитовЗначение.СписокВыбора.Добавить("2");
		Элементы.ДеревоРеквизитовЗначение.СписокВыбора.Добавить("3");
		Элементы.ДеревоРеквизитовЗначение.СписокВыбора.Добавить("4");
		Элементы.ДеревоРеквизитовЗначение.СписокВыбора.Добавить("5"); 
	Иначе
		Элементы.ДеревоРеквизитовЗначение.РежимВыбораИзСписка = Ложь;
		Элементы.ДеревоРеквизитовЗначение.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ДеревоРеквизитовЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
		
	ТекущийИдентификаторЭлемента = ТекущиеДанные.ИдентификаторЭлемента;

	ТекущиеДанныеСерверов = Элементы.ДеревоСерверов.ТекущиеДанные;     
	
	Если ТекущиеДанныеСерверов = Неопределено Тогда 
		ТекущееИмяЭлемента 	= "";
		ЭтоСерверПриложений = Ложь;
	Иначе
		ТекущееИмяЭлемента 	= ТекущиеДанныеСерверов.ИмяЭлемента; 
		ЭтоСерверПриложений = ТекущееИмяЭлемента = "Серверы приложений";
	КонецЕсли;
	
	//Количество дисков
	Если ТекущиеДанные.ИдентификаторРеквизита = "cba48746-01d2-447a-aea1-f2de5f9787f2" Тогда
		Если ВыбранноеЗначение = ТекущиеДанные.Значение Тогда	
			Возврат;
		КонецЕсли; 
		
		КоличествоНовое 	= Число(?(_dl_ServiceDiscoveryВызовСервера.ЭтоЧисло(ВыбранноеЗначение), Число(ВыбранноеЗначение), 0));
		КоличествоТекущее 	= Число(?(_dl_ServiceDiscoveryВызовСервера.ЭтоЧисло(ТекущиеДанные.Значение), Число(ТекущиеДанные.Значение), 0));
		
		ТекущийЭлементДерева = ДеревоРеквизитов.НайтиПоИдентификатору(Элементы.ДеревоРеквизитов.ТекущаяСтрока).ПолучитьЭлементы();
		
		Итератор = КоличествоНовое - КоличествоТекущее;
		Если Итератор > 0 Тогда 
			ПараметрыДанных = Новый Структура;       
			ПараметрыДанных.Вставить("КоличествоТекущее", 				КоличествоТекущее);
			ПараметрыДанных.Вставить("КоличествоТекущее", 				КоличествоТекущее);
			ПараметрыДанных.Вставить("КоличествоНовое", 				КоличествоНовое);
			ПараметрыДанных.Вставить("ВыбранныйИдентификаторРеквизита", ТекущиеДанные.ИдентификаторРеквизита);
			ПараметрыДанных.Вставить("ЭтоСерверПриложений", 			ЭтоСерверПриложений);
			
			ДобавитьНовыеРеквизитыПоДискам(ПараметрыДанных);	
		Иначе 
			Счетчик 		= 0; 
			МассивУдаления 	= Новый Массив;
			Для каждого СтрокаДерева Из ТекущийЭлементДерева Цикл
				Счетчик = Счетчик + 1;
				Если Счетчик > КоличествоНовое Тогда
					МассивУдаления.Добавить(СтрокаДерева);
				КонецЕсли;
			КонецЦикла;	 
			
			Для каждого Элемент Из МассивУдаления Цикл
				ОчиститьРеквизитВРС(Элемент.ИдентификаторРеквизита);	
				
				ТекущийЭлементДерева.Удалить(Элемент);
			КонецЦикла;
		КонецЕсли;	
				
		ТекущееЗначение = ВыбранноеЗначение;
		
		ТекущиеДанныеДерева = Элементы.ДеревоСерверов.ТекущиеДанные;     
		
		Если ТекущиеДанныеДерева = Неопределено Тогда 
			ТекущееИмяЭлемента = "";	         
		Иначе
			ТекущееИмяЭлемента = ТекущиеДанныеДерева.ИмяЭлемента;
		КонецЕсли;	
				
		ТекущийИдентификаторРеквизита 	= ТекущиеДанные.ИдентификаторРеквизита;

		ПодключитьОбработчикОжидания("ИзменитьЗначениеРеквизита", 0.1, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Процедура ДобавитьНовыеРеквизитыПоДискам(ПараметрыДанных)
	
	ОбщиеРеквизитыДиска = ПолучитьРеквизитыИзМакета("РеквизитыДиска");
	
	ТекущийЭлементДерева = ДеревоРеквизитов.НайтиПоИдентификатору(Элементы.ДеревоРеквизитов.ТекущаяСтрока).ПолучитьЭлементы();
	
	Для А = ПараметрыДанных.КоличествоТекущее+1 По ПараметрыДанных.КоличествоНовое Цикл 
		//Диск
		СтрокаДерева 						= ТекущийЭлементДерева.Добавить();	
		СтрокаДерева.Реквизит 				= "Диск "+А;  
		СтрокаДерева.ИдентификаторРеквизита = Новый УникальныйИдентификатор;
		СтрокаДерева.ИдентификаторЭлемента	= ТекущийИдентификаторЭлемента;
		
		ТекущийИдентификаторРеквизита = СтрокаДерева.ИдентификаторРеквизита;
		
		Если ЗначениеЗаполнено(ТекущийИдентификаторЭлемента) Тогда 			
			ЗаписатьРеквизитВРС(СтрокаДерева.Реквизит, ТекущийИдентификаторЭлемента, Ложь, ПараметрыДанных.ЭтоСерверПриложений, ПараметрыДанных.ВыбранныйИдентификаторРеквизита);
		Иначе
			ЗаписатьВсеВложенныеРеквизитыВРС(СтрокаДерева.Реквизит, Ложь, ПараметрыДанных.ЭтоСерверПриложений, ПараметрыДанных.ВыбранныйИдентификаторРеквизита);	
		КонецЕсли;
		
		Для каждого РеквизитДиска Из ОбщиеРеквизитыДиска Цикл
			СтрокаДереваРеквизит 						= СтрокаДерева.ПолучитьЭлементы().Добавить();	
			СтрокаДереваРеквизит.Реквизит 				= РеквизитДиска.Реквизит;  
			СтрокаДереваРеквизит.ИдентификаторРеквизита = РеквизитДиска.ИдентификаторРеквизита;
			СтрокаДереваРеквизит.ИдентификаторЭлемента	= ТекущийИдентификаторЭлемента;
			СтрокаДереваРеквизит.ОбязателенДляЗаполнения= Истина;
			
			ТекущийИдентификаторРеквизита = СтрокаДереваРеквизит.ИдентификаторРеквизита;
			
			Если ЗначениеЗаполнено(ТекущийИдентификаторЭлемента) Тогда 
				ЗаписатьРеквизитВРС(СтрокаДереваРеквизит.Реквизит, ТекущийИдентификаторЭлемента, Истина, ПараметрыДанных.ЭтоСерверПриложений, СтрокаДерева.ИдентификаторРеквизита);
			Иначе
				ЗаписатьВсеВложенныеРеквизитыВРС(СтрокаДереваРеквизит.Реквизит, Истина, ПараметрыДанных.ЭтоСерверПриложений, СтрокаДерева.ИдентификаторРеквизита);	
			КонецЕсли;  
		КонецЦикла;
		
		////Тип диска
		//СтрокаДереваРеквизит 						= СтрокаДерева.ПолучитьЭлементы().Добавить();	
		//СтрокаДереваРеквизит.Реквизит 				= "Тип диска";  
		//СтрокаДереваРеквизит.ИдентификаторРеквизита = Новый УникальныйИдентификатор;
		//СтрокаДереваРеквизит.ИдентификаторЭлемента	= ТекущийИдентификаторЭлемента; 
		//СтрокаДереваРеквизит.ОбязателенДляЗаполнения= Истина;
		//
		//ТекущийИдентификаторРеквизита = СтрокаДереваРеквизит.ИдентификаторРеквизита;
		//
		//Если ЗначениеЗаполнено(ТекущийИдентификаторЭлемента) Тогда 
		//	ЗаписатьРеквизитВРС(СтрокаДереваРеквизит.Реквизит, ТекущийИдентификаторЭлемента, Истина, ЭтоСерверПриложений, СтрокаДерева.ИдентификаторРеквизита);
		//Иначе
		//	ЗаписатьВсеВложенныеРеквизитыВРС(СтрокаДереваРеквизит.Реквизит, Истина, ЭтоСерверПриложений, СтрокаДерева.ИдентификаторРеквизита);	
		//КонецЕсли;
	КонецЦикла;		
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьРеквизитВРС(ИмяРеквизит, ИдентификаторЭлемента, ОбязателенДляЗаполнения, ЭтоСерверПриложений, Родитель)
	
	Запись = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьМенеджерЗаписи();
	
	Запись.ИдентификаторЭлемента 	= ИдентификаторЭлемента; 
	Запись.ИдентификаторРеквизита 	= ТекущийИдентификаторРеквизита;
	Запись.ИмяЭлемента 				= ТекущееИмяЭлемента;
	Запись.Реквизит 				= ИмяРеквизит; 	
	Запись.ОбязателенДляЗаполнения 	= ОбязателенДляЗаполнения;	
	Запись.СерверПриложений			= ЭтоСерверПриложений; 
	Запись.РодительРеквизита		= Родитель;
	Запись.МестоИспользования		= "КластерСерверов";
	
	Запись.Записать();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьВсеВложенныеРеквизитыВРС(ИмяРеквизит, ОбязателенДляЗаполнения, ЭтоСерверПриложений, Родитель)
	
	МассивСерверов = Новый Массив;
	Для каждого СтрокаДерева Из ДеревоСерверов.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.ИмяЭлемента <> ТекущееИмяЭлемента Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаСервера Из СтрокаДерева.ПолучитьЭлементы() Цикл
			Если СтрокаСервера.Редактируемый Тогда
				МассивСерверов.Добавить(СтрокаСервера.ИдентификаторЭлемента); 	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;                  
	
	Для каждого Элемент Из МассивСерверов Цикл		
		ЗаписатьРеквизитВРС(ИмяРеквизит, Элемент, ОбязателенДляЗаполнения, ЭтоСерверПриложений, Родитель);	
	КонецЦикла;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
	//|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита КАК ИдентификаторРеквизита,
	//|	_dl_ПромежуточноеЗаполнениеКЕ.Родитель КАК Родитель
	//|ИЗ
	//|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
	//|ГДЕ
	//|	_dl_ПромежуточноеЗаполнениеКЕ.СерверПриложений = &СерверПриложений
	//|	И _dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита = &ИдентификаторРеквизита
	//|	И _dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента В(&МассивСерверов)";
	//
	//Запрос.УстановитьПараметр("МассивСерверов", 		МассивСерверов);
	//Запрос.УстановитьПараметр("ИдентификаторРеквизита", ТекущийИдентификаторРеквизита);
	//Запрос.УстановитьПараметр("СерверПриложений", 		(ТекущееИмяЭлемента = "Серверы приложений"));
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	ТекущийИдентификаторРеквизита 	= Выборка.ИдентификаторРеквизита;
	//	ТекущийИдентификаторЭлемента 	= Выборка.ИдентификаторЭлемента; 
	//	
	//	ЗаписатьРеквизитВРС(ИмяРеквизит, ОбязателенДляЗаполнения, ЭтоСерверПриложений, Родитель);
	//	
	//КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитВРС(ИдентификаторРеквизита)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита КАК ИдентификаторРеквизита,
		|	_dl_ПромежуточноеЗаполнениеКЕ.РодительРеквизита КАК РодительРеквизита
		|ИЗ
		|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
		|ГДЕ
		|	_dl_ПромежуточноеЗаполнениеКЕ.РодительРеквизита = &ИдентификаторРеквизита
		|	И _dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторЭлемента,
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита,
		|	_dl_ПромежуточноеЗаполнениеКЕ.РодительРеквизита
		|ИЗ
		|	РегистрСведений._dl_ПромежуточноеЗаполнениеКЕ КАК _dl_ПромежуточноеЗаполнениеКЕ
		|ГДЕ
		|	_dl_ПромежуточноеЗаполнениеКЕ.ИдентификаторРеквизита = &ИдентификаторРеквизита
		|	И _dl_ПромежуточноеЗаполнениеКЕ.МестоИспользования = ""КластерСерверов""";
	
	Запрос.УстановитьПараметр("ИдентификаторРеквизита", ИдентификаторРеквизита);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений._dl_ПромежуточноеЗаполнениеКЕ.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторЭлемента.Установить(ТекущийИдентификаторЭлемента);
		Набор.Отбор.ИдентификаторРеквизита.Установить(Выборка.ИдентификаторРеквизита);
		Набор.Отбор.РодительРеквизита.Установить(Выборка.РодительРеквизита);
		
		Набор.Записать();		
		
	КонецЦикла;	
		
КонецПроцедуры 
